a=["3 + 5 = ","5 + 5 = ","10 + 5 = ","2 + 2 = ","4 + 1 = "]
b=0
с=0
print("Математика для детей!")
while b<=3:
    a = int(input(a[0]))
    if a == 8:
        b==0
        с+=1
        print("Правильно!")
    else:
        b+=1
        print("НЕ правильно(((")
    a = int(input(a[1]))
    if a == 10:
        b==0
        с += 1
        print("Правильно!")
    else:
        b+=1
        print("НЕ правильно(((")
    a = int(input(a[2]))
    if a == 15:
        b == 0
        с += 1
        print("Правильно!")
    else:
        b += 1
        print("НЕ правильно(((")
    a = int(input(a[3]))
    if a == 4:
        b == 0
        с += 1
        print("Правильно!")
    else:
        b += 1
        print("НЕ правильно(((")
    a = int(input(a[4]))
    if a == 5:
        b == 0
        с += 1
        print("Правильно!")
    else:
        b += 1
        print("НЕ правильно(((")
print("Игра окончена! Правильных ответов:",с)


